[
  {
    "skillId": 1,
    "skillName": "Beginner Guitar Lessons",
    "providerName": "Alex Martin",
    "providerEmail": "alex@skillswap.com",
    "price": 20,
    "rating": 4.8,
    "slotsAvailable": 3,
    "description": "Welcome to Beginner Guitar Lessons! This course is designed for absolute beginners who have never held a guitar before.\n\nWe start with understanding the parts of the guitar, proper posture, and how to hold a pick correctly.\n\nYou'll learn basic finger exercises to strengthen your hands and improve dexterity.\n\nFrom there, we move to essential open chords including C, G, D, A, and E, and learn how to transition smoothly between them.\n\nStrumming patterns are introduced gradually, starting with simple downstrokes and progressing to up-down rhythms.\n\nWe'll explore easy, popular songs that help you apply chords and strumming patterns.\n\nEach lesson includes detailed explanations, video demonstrations, and practice tips.\n\nYou'll also learn how to read chord diagrams, tablature, and basic sheet music.\n\nAdditional topics include tuning your guitar, maintaining proper finger placement, and avoiding common beginner mistakes.\n\nRhythm exercises, timing practice, and basic music theory are included to strengthen understanding.\n\nYou will develop confidence in playing simple melodies and accompanying songs.\n\nThe course emphasizes building a strong foundation for both acoustic and electric guitars.\n\nBy the end, you will be able to play several beginner songs and continue progressing independently.\n\nWe also cover techniques to enhance finger strength and dexterity for smoother chord changes.\n\nPractical tips on practicing effectively and maintaining a regular routine are provided.\n\nThis course is perfect for students of all ages and backgrounds.\n\nWhether your goal is to play for fun, join a band, or prepare for more advanced guitar studies, this course gives you the tools and confidence to succeed.\n\nEnjoy creating music and developing a lifelong skill with guided support.",
    "image": "https://picsum.photos/seed/guitar/200/200",
    "category": "Music"
  },
  {
    "skillId": 2,
    "skillName": "Spoken English Practice",
    "providerName": "Sara Hossain",
    "providerEmail": "sara@skillswap.com",
    "price": 10,
    "rating": 4.6,
    "slotsAvailable": 5,
    "description": "Spoken English Practice is designed for learners who want to improve fluency, pronunciation, and confidence in speaking English.\n\nWe focus on conversational skills for everyday life, work, and travel.\n\nThe course starts with greetings, introductions, and basic expressions.\n\nYou will learn how to respond naturally in common situations through structured exercises.\n\nListening comprehension activities develop your understanding of different accents and speech speeds.\n\nPronunciation techniques, intonation, and stress patterns are taught to make your speech clear and confident.\n\nRole-playing exercises simulate real-world conversations in restaurants, airports, and offices.\n\nVocabulary building focuses on essential words and phrases for daily interactions.\n\nGrammar essentials are reinforced in a practical, context-based way.\n\nGroup discussions encourage peer feedback and collaborative learning.\n\nHomework and practice exercises reinforce spoken skills outside class.\n\nCultural tips are shared to help you understand context and expressions.\n\nWe also practice telephone conversations, emailing, and small talk scenarios.\n\nEach lesson gradually increases complexity to build confidence over time.\n\nBy the end, you will confidently engage in conversations in various contexts.\n\nYou will be able to understand spoken English more effectively and express yourself clearly.\n\nThe course is suitable for beginners, travelers, and anyone seeking professional or personal growth.\n\nJoin now to start speaking English fluently and comfortably, with guidance and support.",
    "image": "https://picsum.photos/seed/english/200/200",
    "category": "Language"
  },
  {
    "skillId": 3,
    "skillName": "Introduction to Python",
    "providerName": "Raj Patel",
    "providerimage":"https://i.postimg.cc/9FbmyZzR/download.jpg", 
    "providerEmail": "raj@skillswap.com",
    "price": 35,
    "rating": 4.9,
    "slotsAvailable": 2,
    "description": "Introduction to Python is designed for beginners who want to learn programming from scratch.\n\nThe course covers variables, data types, loops, conditionals, functions, and object-oriented programming.\n\nWe start by installing Python and understanding the development environment.\n\nSimple exercises are given to reinforce each concept, allowing learners to apply knowledge immediately.\n\nYou'll learn debugging techniques and how to handle errors effectively.\n\nProjects include building calculators, small games, and basic data analysis programs.\n\nLessons include explanations, examples, and step-by-step guidance.\n\nWe also cover lists, dictionaries, sets, and working with files.\n\nStudents practice problem-solving using Python and develop logical thinking.\n\nThe course emphasizes writing clean and readable code.\n\nWe explore loops and conditionals in depth to build strong programming foundations.\n\nBy the end, learners will be able to write small programs independently.\n\nThey will have the skills to continue exploring Python for web development, data science, or automation.\n\nBest practices for coding and debugging are highlighted throughout the course.\n\nLearners gain confidence in applying programming concepts.\n\nHands-on practice ensures that theory is applied in real scenarios.\n\nThe course prepares students for more advanced programming topics.\n\nJoin now and start coding in Python effectively.",
    "image": "https://picsum.photos/seed/python/200/200",
    "category": "Technology"
  },
  {
    "skillId": 4,
    "skillName": "Digital Photography 101",
    "providerName": "Emily Chen",
    "providerEmail": "emily@skillswap.com",
    "price": 25,
    "rating": 4.7,
    "slotsAvailable": 4,
    "description": "Digital Photography 101 is perfect for beginners who want to take professional-looking photos.\n\nThe course covers camera basics, including aperture, shutter speed, ISO, and lens selection.\n\nWe explore composition techniques, lighting, and perspective.\n\nHands-on exercises teach students to photograph landscapes, portraits, and still-life subjects.\n\nPost-processing basics using software tools are included.\n\nStudents learn framing, rule of thirds, leading lines, and color balance.\n\nControl of depth of field and light is emphasized.\n\nAssignments allow learners to practice skills in real-world scenarios.\n\nAdvanced topics like long exposure and creative photography effects are introduced.\n\nLessons encourage experimentation and creative expression.\n\nTips for photographing in different lighting conditions are included.\n\nStudents develop an eye for composition and detail.\n\nWe cover portrait and product photography techniques.\n\nThe course emphasizes developing a personal style.\n\nEditing tutorials help refine captured images.\n\nPractical exercises reinforce classroom learning.\n\nBy the end, students can confidently take and edit high-quality photos.\n\nThis course provides a solid foundation for aspiring photographers.",
    "image": "https://picsum.photos/seed/camera/200/200",
    "category": "Art"
  },
  {
    "skillId": 5,
    "skillName": "Basic Home Cooking",
    "providerName": "Marcus Jones",
    "providerEmail": "marcus@skillswap.com",
    "price": 15,
    "rating": 4.5,
    "slotsAvailable": 6,
    "description": "Basic Home Cooking teaches essential cooking techniques for beginners.\n\nThe course covers meal planning, ingredient selection, knife skills, and kitchen safety.\n\nStudents learn to prepare simple, healthy dishes including salads, soups, pasta, and baked goods.\n\nLessons focus on flavor balance, seasoning, and cooking methods like boiling, sautéing, roasting, and baking.\n\nTips for time management and efficient workflow are included.\n\nDemonstrations of various cooking techniques are provided.\n\nStudents learn to adjust recipes and substitute ingredients.\n\nPractical exercises ensure skill retention.\n\nStudents practice preparing full meals step by step.\n\nCourse emphasizes presentation and plating skills.\n\nCooking exercises encourage creativity and experimentation.\n\nBy the end, learners can prepare everyday meals with confidence.\n\nRecipes include breakfast, lunch, and dinner options.\n\nTechniques for baking bread and simple desserts are introduced.\n\nStudents gain knowledge of healthy nutrition.\n\nPractical tips for cleaning and kitchen organization are included.\n\nThis course is ideal for anyone wanting to cook efficiently at home.\n\nJoin to gain confidence and enjoy home-cooked meals.",
    "image": "https://picsum.photos/seed/cooking/200/200",
    "category": "Lifestyle"
  },
  {
    "skillId": 6,
    "skillName": "Yoga for Stress Relief",
    "providerName": "Leah Green",
    "providerimage":"https://i.postimg.cc/K8mK2m3s/download.jpg",
    "providerEmail": "leah@skillswap.com",
    "price": 18,
    "rating": 4.9,
    "slotsAvailable": 8,
    "description": "Yoga for Stress Relief focuses on gentle, restorative practices to reduce stress.\n\nThe course includes breathing exercises, mindfulness meditation, and gentle flows.\n\nStudents learn relaxation techniques, proper posture, and stretching routines.\n\nEach session combines guided movements with deep breathing.\n\nYoga sequences target tension in shoulders, neck, back, and hips.\n\nMeditation practices teach focus, awareness, and calmness.\n\nProgressive relaxation and guided imagery are included.\n\nStudents are encouraged to practice daily routines.\n\nTopics cover ergonomics, mindfulness, and coping with anxiety.\n\nStudents learn visualization techniques and gentle flows.\n\nLessons emphasize mental clarity and physical relaxation.\n\nBy the end, participants experience improved flexibility and reduced tension.\n\nStudents learn stress management strategies.\n\nSessions focus on breathing and body awareness.\n\nExercises can be applied at home or work.\n\nStudents gain confidence in practicing yoga independently.\n\nThe course is suitable for beginners and all ages.",
    "image": "https://picsum.photos/seed/yoga/200/200",
    "category": "Health"
  },
  {
    "skillId": 7,
    "skillName": "Advanced Excel Formulas",
    "providerName": "Ben Kim",
    "providerEmail": "ben@skillswap.com",
    "price": 30,
    "rating": 4.7,
    "slotsAvailable": 3,
    "description": "Advanced Excel Formulas is designed for students and professionals wanting to master Excel.\n\nThe course covers VLOOKUP, HLOOKUP, INDEX, MATCH, and logical formulas.\n\nPivot Tables, conditional formatting, and data visualization are included.\n\nStudents practice real-world scenarios such as financial analysis and reporting dashboards.\n\nMacros, automation, and basic VBA scripting are introduced.\n\nLessons include best practices for organizing data.\n\nError handling and debugging techniques are emphasized.\n\nExercises reinforce workplace efficiency skills.\n\nStudents learn to combine multiple formulas for complex calculations.\n\nCourse emphasizes workflow optimization.\n\nTips for data cleaning and consistency are included.\n\nBy the end, learners can confidently analyze data and create reports.\n\nStudents develop problem-solving skills using Excel.\n\nPractical exercises simulate real business situations.\n\nThe course is suitable for professionals, analysts, and students.\n\nStudents gain confidence in using Excel for advanced tasks.\n\nJoin now to improve Excel expertise and productivity.",
    "image": "https://picsum.photos/seed/excel/200/200",
    "category": "Business"
  },
  {
    "skillId": 8,
    "skillName": "Creative Writing Workshop",
    "providerName": "Chloe Davis",
    "providerEmail": "chloe@skillswap.com",
    "price": 22,
    "rating": 4.8,
    "slotsAvailable": 5,
    "description": "Creative Writing Workshop develops fiction, poetry, and non-fiction writing skills.\n\nLessons focus on storytelling, character development, and narrative structure.\n\nWriting prompts and peer review sessions enhance creativity.\n\nGuided exercises improve dialogue, pacing, and plot development.\n\nGrammar, style, and editing are covered to polish drafts.\n\nWorkshops provide feedback to build confidence.\n\nAdvanced exercises explore literary devices and genre conventions.\n\nStudents develop unique voices and writing styles.\n\nPractical assignments help produce complete stories.\n\nTechniques for creative expression are emphasized.\n\nBy the end, participants will have written multiple polished pieces.\n\nStudents learn to plan, draft, and edit effectively.\n\nThe course encourages experimentation and risk-taking in writing.\n\nLessons cover descriptive, persuasive, and narrative writing.\n\nParticipants receive individual and group feedback.\n\nCourse helps build consistent writing habits.\n\nStudents gain confidence in publishing their work.\n\nIdeal for aspiring writers and hobbyists.",
    "image": "https://picsum.photos/seed/writing/200/200",
    "category": "Art"
  },
  {
    "skillId": 9,
    "skillName": "Spanish for Travelers",
    "providerName": "Miguel Perez",
    "providerEmail": "miguel@skillswap.com",
    "price": 12,
    "rating": 4.5,
    "slotsAvailable": 7,
    "description": "Spanish for Travelers teaches essential phrases for traveling.\n\nLessons cover greetings, directions, ordering food, and basic conversation.\n\nStudents learn pronunciation, vocabulary, and cultural etiquette.\n\nPractice exercises simulate real-life travel scenarios.\n\nRole-playing helps build confidence.\n\nListening exercises improve comprehension of spoken Spanish.\n\nGrammar is introduced gradually to support communication.\n\nTips for navigating airports, hotels, and restaurants are included.\n\nStudents practice common expressions and travel dialogues.\n\nBy the end, learners can communicate effectively during travel.\n\nCourse emphasizes conversational Spanish.\n\nStudents develop confidence in speaking and understanding.\n\nCultural insights enhance understanding of local customs.\n\nExercises include dialogue creation, translation, and comprehension.\n\nStudents practice key phrases daily.\n\nPractical vocabulary is prioritized.\n\nJoin to prepare for trips and enjoy Spanish-speaking environments.",
    "image": "https://picsum.photos/seed/spanish/200/200",
    "category": "Language"
  },
  {
    "skillId": 10,
    "skillName": "DIY Basic Car Maintenance",
    "providerName": "David Lee",
    "providerEmail": "david@skillswap.com",
    "price": 28,
    "rating": 4.6,
    "slotsAvailable": 4,
    "description": "DIY Basic Car Maintenance teaches essential skills for vehicle upkeep.\n\nLessons cover oil changes, tire rotations, and fluid checks.\n\nStudents learn to inspect brakes, lights, and battery health.\n\nTools and safety procedures are emphasized.\n\nPractical demonstrations guide learners step-by-step.\n\nTroubleshooting common car issues is included.\n\nBy the end, students can perform basic maintenance confidently.\n\nLessons focus on routine upkeep and preventative care.\n\nStudents develop problem-solving skills for minor car repairs.\n\nTips for cost-effective maintenance are shared.\n\nSafety and efficiency are highlighted.\n\nStudents learn to interpret warning signs and gauges.\n\nPractical exercises simulate real-world scenarios.\n\nMaintenance schedules and records are explained.\n\nStudents gain hands-on experience.\n\nCourse builds confidence in caring for vehicles.\n\nStudents can handle emergency situations and minor repairs.",
    "image": "https://picsum.photos/seed/car/200/200",
    "category": "Practical"
  },
  {
    "skillId": 11,
    "skillName": "Web Development Fundamentals (HTML/CSS)",
    "providerName": "Nadia Singh",
    "providerimage":"https://i.postimg.cc/QCVBvmB5/download.jpg",
    "providerEmail": "nadia@skillswap.com",
    "price": 40,
    "rating": 4.9,
    "slotsAvailable": 2,
    "description": "Web Development Fundamentals teaches HTML and CSS from scratch.\n\nStudents learn to structure webpages, style elements, and create responsive designs.\n\nThe course includes hands-on exercises to build web pages step-by-step.\n\nLessons cover semantic HTML, tags, attributes, and accessibility.\n\nCSS fundamentals include selectors, properties, colors, fonts, and layouts.\n\nStudents explore flexbox, grid, and responsive design techniques.\n\nPractical projects include landing pages, portfolios, and interactive elements.\n\nBy the end, learners can create functional, visually appealing websites.\n\nBest practices for coding, debugging, and organization are taught.\n\nStudents gain confidence to continue with JavaScript or frameworks.\n\nAssignments include building complete web pages from scratch.\n\nTips for cross-browser compatibility are shared.\n\nStudents learn to test and optimize pages.\n\nCourse emphasizes creativity and practical application.\n\nStudents gain foundational skills for web development careers.\n\nHands-on practice ensures retention.\n\nSupport is provided for troubleshooting and guidance.",
    "image": "https://picsum.photos/seed/htmlcss/200/200",
    "category": "Technology"
  },
  {
    "skillId": 12,
    "skillName": "Watercolor Painting for Fun",
    "providerName": "Oliver King",
    "providerEmail": "oliver@skillswap.com",
    "price": 17,
    "rating": 4.4,
    "slotsAvailable": 6,
    "description": "Watercolor Painting for Fun is designed for beginners and hobbyists.\n\nThe course covers basic techniques, brush handling, color mixing, and layering.\n\nStudents practice gradients, washes, and textures.\n\nStep-by-step exercises guide learners through projects like landscapes, florals, and abstract designs.\n\nCreative exercises encourage personal expression.\n\nLessons include exploring different paper types and paint qualities.\n\nStudents learn blending, light, shadow, and composition principles.\n\nTechniques for correcting mistakes and enhancing artwork are provided.\n\nAssignments encourage experimentation with styles.\n\nBy the end, students will complete several watercolor paintings.\n\nPractical tips for displaying and preserving art are shared.\n\nStudents gain confidence in using watercolor creatively.\n\nCourse emphasizes relaxation, creativity, and mindfulness.\n\nTechniques for layering, glazing, and texture are taught.\n\nStudents learn to combine colors effectively.\n\nProjects include still-life, scenery, and abstract concepts.\n\nThe course is fun, engaging, and suitable for all skill levels.",
    "image": "https://picsum.photos/seed/watercolor/200/200",
    "category": "Art"
  }
]